// let a = 12;
// let b = a;
// b = 13;
// console.log(a);

// let n = {
//     name: '珠峰'
// };
// let m = n;
// m.name = '培训';
// console.log(n.name);
//基本类型：按值操作（直接操作的是值），所以也叫做值类型
//引用类型：操作的是堆内存的地址（按引用地址操作的）

/**
 *  浏览器想要执行JS代码
 *  1.从电脑内存中分配出一块内存，用来执行代码（栈内存：Stack）
 *  2.分配一个主线程用来自上而下执行JS代码
 *
 */

/**
 *  栈内存包含变量存储空间、值存储空间和主线程
 *  每行代码需要在栈内存的主线程中：进栈->执行代码->出栈->下一条代码进栈...出栈
 *  
 */
//面试题1
// let n = [10, 20];
// let m = n;
// let x = m;
// m[0] = 100;
// x = [30, 40];
// x[0] = 200;
// m = x;
// m[1] = 300;
// n[2] = 400;
// console.log(n, m, x);

//面试题2 提示：从左到右，将{n:2}赋值给a.x也赋值给a
let a = {
    n: 1
};
let b = a;
a.x = a = {
    n: 2
};
console.log(a.x);
console.log(b);

//堆内存溢出
let a = {
    n: 1
};
let b = a;
a.x = b;